Repository: bogdro/wipefreespace
Catalog: po/*.po
Languages: pl

source: version
pl: wersja

source: Program for secure cleaning of free space on filesystems. This program is Free Software; you can redistribute it and/or modify it under the terms of the GNU General Public License as published by the Free Software Foundation; either version 2 of the License, or (at your option) any later version. This program is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
pl: Program do bezpiecznego czyszczenia pustego miejsca na systemach plików Niniejszy program jest Wolnym Oprogramowaniem; możesz go rozprowadzać dalej i/lub modyfikować na warunkach Powszechnej Licencji Publicznej GNU, wydanej przez Fundację Wolnego Oprogramowania - wedug wersji 2-giej tej Licencji lub którejś z późniejszych wersji. Niniejszy program rozpowszechniany jest z nadzieją, iż będzie on użyteczny - jednak BEZ JAKIEJKOLWIEK GWARANCJI, nawet domyślnej gwarancji PRZYDATNOŚCI HANDLOWEJ albo PRZYDATNOŚCI DO OKREŚLONYCH ZASTOSOWAŃ

source: error
pl: błąd

source: during opening
pl: podczas otwierania

source: while flushing
pl: podczas zapisu systemu na dysk

source: during closing
pl: podczas zamykania

source: during malloc while working on
pl: przy alokacji pamięci podczas pracy na

source: during checking if the file system is mounted
pl: podczas sprawdzania, czy system plików jest zamontowany

source: - Device is mounted in read-write mode
pl: - Urządzenie jest zamontowane do odczytu i zapisu

source: during reading block bitmap from
pl: podczas czytania bitmapy bloków z

source: during writing of a block on
pl: podczas zapisu bloku na

source: during reading of a block on
pl: podczas czytania bloku z

source: during reading of an inode on
pl: podczas czytania i-węzła z

source: while trying to set a signal handler for
pl: podczas ustawiania procedury obsługi sygnału

source: Filesystem has errors
pl: System plików zawiera błędy

source: during opening a scan of
pl: podczas otwierania skanu na

source: during iterating over blocks on
pl: podczas iterowania po blokach na

source: during iterating over a directory on
pl: podczas iterowania katalogu na

source: Nothing selected for wiping.
pl: Nie wybrano nic do czyszczenia.

source: PLEASE do NOT set this program's suid bit. Use sgid instead.
pl: PROSZĘ NIE ustawiaj bitu suid dla tego programu. Zamiast tego, użyj sgid.

source: during setting capabilities
pl: podczas ustawiania uprawnień programu

source: during creation of child process
pl: podczas tworzenia procesu potomnego

source: during disabling device cache
pl: podczas wyłączania pamięci podręcznej urządzenia

source: during enabling device cache
pl: podczas włączania pamięci podręcznej urządzenia

source: during opening an attribute
pl: podczas otwierania atrybutu

source: during mapping a runlist
pl: podczas mapowania listy

source: during creating a search context
pl: podczas tworzenia kontekstu wyszukiwania

source: during checking parameters
pl: podczas sprawdzania parametrów

source: during creating a pipe
pl: podczas tworzenia potoku

source: during starting a sub-process
pl: podczas uruchamiania procesu potomnego

source: during seeking to position
pl: podczas zmiany pozycji

source: during performing a control operation on
pl: podczas wykonywania operacji sterującej

source: Setting signal handlers
pl: Ustawianie procedur obsługi sygnałów

source: Checking if file system is mounted
pl: Sprawdzanie, czy system plików jest zamontowany

source: Opening file system
pl: Otwieranie systemu plików

source: Flushing file system
pl: Zapisuję niezapisane zmiany w systemie plików

source: Wiping free space on file system
pl: Czyszczę puste miejsce na systemie plików

source: Wiping unused space in used blocks on
pl: Czyszczę nieużywane miejsce w używanych blokach na

source: Wiping undelete data on
pl: Czyszczę dane służące do odzyskiwania plików na

source: Closing file system
pl: Zamykam system plików

source: Going into background not supported or failed
pl: Przechodzenie w tło nie jest obsługiwane lub nie powiodło się

source: Disabling cache
pl: Wyłączanie pamięci podręcznej urządzenia

source: unknown
pl: nieznany

source: - Program for secure cleaning of free space on filesystems Syntax:
pl: - Program do bezpiecznego czyszczenia pustego miejsca na systemach plików Składnia:

source: [options]
pl: [opcje]

source: Options:
pl: Opcje:

source: --all-zeros Use only zeros for wiping
pl: --all-zeros Używaj tylko zer do wymazywania

source: --background Continue work in the background, if possible
pl: --background Kontynuuj pracę w tle, jeśli to możliwe

source: -b|--superblock <off> Superblock offset on the given filesystems
pl: -b|--superblock <off> Pozycja Superbloku na podanych systemach plików

source: -B|--blocksize <size> Block size on the given filesystems
pl: -B|--blocksize <size> Rozmiar bloku na podanych systemach plików

source: -f|--force Wipe even if the file system has errors
pl: -f|--force Czyść nawet gdy system plików ma błędy

source: -h|--help Print help
pl: -h|--help Wyświetl pomoc

source: -n|--iterations NNN Number of passes (greater than 0)
pl: -n|--iterations NNN Liczba przejść (większa od 0)

source: --last-zero Perform additional wiping with zeros
pl: --last-zero Wykonaj dodatkowe zamazywanie zerami

source: -l|--license Print license information
pl: -l|--license Wyświetl informacje o licencji

source: --method <name> Use the given method for wiping
pl: --method <nazwa> Użyj podanej metody do wymazywania

source: --nopart Do NOT wipe free space in partially used blocks
pl: --nopart NIE czyść pustego miejsca w częściowo używanych blokach

source: --nounrm Do NOT wipe undelete information
pl: --nounrm NIE czyść informacji służących do odzyskiwania plików

source: --nowfs Do NOT wipe free space on file system
pl: --nowfs NIE czyść pustego miejsca na systemie plików

source: --no-wipe-zero-blocks Do NOT wipe all-zero blocks on file system
pl: --no-wipe-zero-blocks NIE czyść bloków zawierających same zera na systemie plików

source: --order <mode> Wiping order - pattern or block
pl: --order <tryb> Tryb czyszczenia - według wzorca lub bloku

source: --use-dedicated Use the program dedicated for the given filesystem type
pl: --use-dedicated Użyj programu dedykowanego pod dany typ systemu plików

source: --use-ioctl Disable device caching during work (can be DANGEROUS)
pl: --use-ioctl Wyłącz pamięć podręczną w czasie pracy (może być NIEBEZPIECZNE)

source: -v|--verbose Verbose output
pl: -v|--verbose Wyświetlaj szczegóły działania

source: -V|--version Print version number
pl: -V|--version Wyświetl numer wersji

source: Using pattern
pl: Używam wzorca

source: random
pl: losowy
